Revit 2027 API
ACADExportOptions.ExportOfSolids Property
 The mode used to export solids in 3D views. Default value is SolidGeometry.Polymesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidGeometry ExportOfSolids { get; set; }
Public Property ExportOfSolids As SolidGeometry
	Get
	Set
public:
property SolidGeometry ExportOfSolids {
	SolidGeometry get ();
	void set (SolidGeometry value);
}
member ExportOfSolids : SolidGeometry with get, set
Property Value
SolidGeometry
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace